{
    "0":{
            "message":"",
            "message_russ":"",
            "desc":"",
            "when_used":""
    },
    "100":{
            "message":"Continue",
            "message_russ":"Продолжай",
            "desc":"",
            "when_used":""
    },
    "101":{
            "message":"Switching Protocols",
            "message_russ":"Переключение протоколов",
            "desc":"Это, наверное, один из самых простых серверных кодов, который означает, что пользователь сделал запрос на переключение типа протокола, используемого на веб-сервере, и сервер дал согласие на это.",
            "when_used":"При переключении на новую версию HTTP с протокола старого типа. Этот запрос выполняется только при наличии более подходящего протокола (иными словами, при наличии более свежей версии HTTP)."
    },
    "102":{
            "message":"Processing",
            "message_russ":"Идёт обработка",
            "desc":"Так как WebDAV-запрос (протокол передачи) может содержать не только один запрос, но также множество подзапросов, включая операции с файлами, он зачастую может затребовать более длительного времени для завершения запроса.",
            "when_used":"Этот код генерируется для того, чтобы оповестить пользователя и необходимости сбросить таймер и ожидать следующей команды в обычном режиме, так как процесс обработки запроса может занять длительное время."
    },
    "200":{
            "message":"OK",
            "message_russ":"Хорошо",
            "desc":"Этот код, вероятно, является самым популярным, но при этом самым незаметным ввиду его характера. Он означает, что обмен между пользователем и сервером завершен, и все прошло так, как должно было.",
            "when_used":"В идеале – постоянно!"
    },
    "201":{
            "message":"Created",
            "message_russ":"Создано",
            "desc":"В результате успешного выполнения запроса был создан новый ресурс. Например, запрос пользователя привел к созданию нового ресурса вроде новой страницы. Сервер-источник должен создать ресурс перед тем, как отправлять код 201. Если ресурс не может быть создан в данный момент, то сервер вместо этого должен отобразить код 202 (accepted).",
            "when_used":""
    },
    "202":{
            "message":"Accepted",
            "message_russ":"Принято",
            "desc":"Запрос был принят на обработку, но она не завершена по каким-либо причинам. Запрос может и не быть выполнен до конца, в зависимости от того, был ли он отклонен в процессе обработки.",
            "when_used":"Когда сервер не может выполнить запрос в тот момент, в который он был сделан. Запрос изначально не рассчитан на обязательное исполнение, и клиенту не обязательно дожидаться окончательной передачи сообщения, так как может быть начат очень долгий процесс."
    },
    "203":{
            "message":"Non-Authoritative Information",
            "message_russ":"Информация не авторитетна",
            "desc":"Сервер успешно обработал запрос, но передаваемая информация была взята не из первичного источника (резервной копии, другого сервера и т. д.) и поэтому может быть неактуальной. По сути, этот код очень похож на 200, но указывает на то, что информация была получена не из первоисточника.",
            "when_used":"Этот код может быть использован вместо 200, когда у отправителя есть причина полагать, что заголовки ответа от постороннего источника могут отличаться от того, что предоставил бы исходный сервер."
    },
    "204":{
            "message":"No Content",
            "message_russ":"Нет содержимого",
            "desc":"Этот код представляет собой ответ, посланный сервером для того, чтобы сообщить, что запрос был получен и понят, но отсутствуют данные, которые можно было отправить пользователю. Это, главным образом, используется для того, чтобы разрешить запуск скриптов, не меняя при этом документ. Данный код не должен содержать тело сообщения, и включается в первую пустую строку кода сразу после заголовка.",
            "when_used":"Этот код, главным образом, используется для того, чтобы позволить осуществить ввод или какие-либо действия без необходимости обновлять документ (страницу)."
    },
    "205":{
            "message":"Reset Content",
            "message_russ":"Сбросить содержимое",
            "desc":"Сервер успешно обработал запрос, но при этом не возвращает какой-либо контент. В отличие от 204, этот ответ требует от запрашиваемого обновить документ",
            "when_used":"Обычно он используется тогда, когда пользователь заполняет форму, а сервер посылает браузеры запрос на очистку формы. Он схож с кодом 204, но просит пользователя сбросить документ после завершения – например, очистить HTML-форму после подтверждения."
    },
    "206":{
            "message":"Partial Content",
            "message_russ":"Частичное содержимое",
            "desc":"Сервер возвращает лишь часть контента, соответствующего заголовку, посланному клиентом. Обычно он используется расширенными инструментами кэширования, когда пользователь запрашивает лишь небольшую часть контента на странице, и сервер в своем ответе предоставляет данные лишь для этой области на странице.",
            "when_used":"Этот кода обычно используется вследствие запрос If-Range, который применяется в мощных валидаторах кэша. Запрос также должен включать заголовки области, которые используется в качестве параметров диапазона возвратной информации."
    },
    "207":{
            "message":"Multi-Status",
            "message_russ":"Многостатусный",
            "desc":"Сервер передаёт результаты выполнения сразу нескольких независимых операций, которые помещают в тело сообщения в виде XML-документа",
            "when_used":""
    },
    "226":{
            "message":"IM Used",
            "message_russ":"Использовано IM",
            "desc":"заголовок A-IM от клиента был успешно принят и сервер возвращает содержимое с учётом указанных параметров. Введено в RFC 3229 для дополнения протокола HTTP поддержкой дельта-кодирования.",
            "when_used":""
    },
    "300":{
            "message":"Multiple Choices",
            "message_russ":"Множество выборов",
            "desc":"В основном, этот код сообщает пользователю о том, что ресурс был перемещен, и сервер отвечает списком доступных альтернативных вариантов, среди которых пользователь может выбрать наиболее подходящий ему ресурс.",
            "when_used":"Обычно этот код можно увидеть, когда сервер считает, что предоставленный пользователем (другими словами, браузером пользователя) URL имеет недостаточно точный указатель, и предлагает дальнейший выбор. Обычно это происходит тогда, когда пользователь использует URL на директорию не самого последнего уровня, и сервер предлагает ему выбор имеющихся файлов или директорий последующего уровня."
    },
    "301":{
            "message":"Moved Permanently",
            "message_russ":"Перемещено навсегда",
            "desc":"Это довольно распространенный пользовательский запрос. Он означает, что запросы для данного ресурса (а также все последующие запросы) должны быть перенаправлены на заданный URL.",
            "when_used":"Когда страница более не существует, либо ссылка, ведущая на сторонний источник, уже не работает. 301 редирект сообщает пользователю о том, что запрашиваемый ресурс был перемещен (обычно это реализуется при помощи файла .htaccess, доступного на серверах Apache)."
    },
    "302":{
            "message":"Moved Temporarily OR Found",
            "message_russ":"Перемещено временно ИЛИ найдено",
            "desc":"Этот код сообщает пользователю, что расположение запрашиваемого ресурса временно изменено, и 302 код состояния должен содержать информацию о новом месторасположении, которое пользователь и должен запросить.",
            "when_used":"У этого кода есть несколько применений, многие из которых не являются тем, для чего код был изначально предназначен. Изначально он представлял собой основной способ создания временного перенаправления. Тем не менее, сегодня существуют и другие – этичные, и неэтичные – способы его применения."
    },
    "303":{
            "message":"See Other",
            "message_russ":"Смотреть другое",
            "desc":"Этот код указывает пользователю на то, что запрашиваемый ресурс можно найти по URL, который отличается от указанного в запросе. Это не обязательно означает, что что-то было перемещено, это код лишь предоставляет адрес, по которому следует запрашивать подобный ответ.",
            "when_used":"Этот метод главным образом существует для того, чтобы позволить выводу данных POST-активированного скрипта перенаправить агента пользователя к выбранному ресурсу."
    },
    "304":{
            "message":"Not Modified",
            "message_russ":"Не изменялось",
            "desc":"Этот код означает, что пользователь запрашивает документ/ресурс только в том случае, если он подвергался изменениям с момента последнего обновления кэша данного документа.",
            "when_used":"Если в ответе от сервера сообщается о том, что параметры документа If-Modified-Since или If-Match не менялись с момента создания последнего кэша, то нет необходимости в повторной отправке ресурса."
    },
    "305":{
            "message":"Use Proxy",
            "message_russ":"Использовать прокси",
            "desc":"Этот код сообщает пользователю, что доступ к запрашиваемому ресурсу возможен только посредством прокси, указанного в ответе.",
            "when_used":"Этот код часто отображается в связи с мерами безопасности, и предоставляет доступ к запрашиваемым URL-ресурсам."
    },
    "306":{
            "message":"Switch Proxy",
            "message_russ":"Зарезервировано (код использовался только в ранних спецификациях)",
            "desc":"Этот код изначально означал «последующие запросы должны использовать указанный прокси», но в данный момент не используется и зарезервирован.",
            "when_used":""
    },
    "307":{
            "message":"Temporary Redirect",
            "message_russ":"Временное перенаправление",
            "desc":"Этот код возвращается, если ресурс на данный момент временно доступен по другому URL, который также предоставляется в ответе. Этот код немного отличается от кода 302 – он представляет собой более определенную версию кода 302.",
            "when_used":"Он используется практически в тех же случаях, что и 302, но пользователь должен продолжить запросы по исходному URL при следующих запросах, либо до тех пор, пока не будет применен новых код ответа."
    },
    "400":{
            "message":"Bad Request",
            "message_russ":"Плохой, неверный запрос",
            "desc":"Запрос не может быть исполнен ввиду синтаксической ошибки.",
            "when_used":"Когда пользователь запрашивает информацию, но делает это, пренебрегая правилами протокола передачи гипертекста. Запрос не следует повторять без изменения синтаксиса."
    },
    "401":{
            "message":"Unauthorized",
            "message_russ":"Не авторизован",
            "desc":"Этот код связан с запросом к ресурсу, который требует авторизации. Ответ 401 указывает на то, что попытка авторизации была отклонена по тем данным, которые предоставил пользователь.",
            "when_used":"Когда пользователь совершает запрос к серверу, используя неправильные данные авторизации (имя пользователя и/или пароль)."
    },
    "402":{
            "message":"Payment Required",
            "message_russ":"Необходима оплата",
            "desc":"Зарезервирован на будущее. Тем не менее, исходное предназначение заключалось в том, что данный код мог использоваться в некоторой форме электронных денег для проведения трансакций, но этого не случилось, и коду не нашлось применения.",
            "when_used":"Старый сервис MobileMe от Apple выдавал ошибку 402, если аккаунт пользователя в MobileMe подозревался в злоупотреблении сервисом. Кроме того, Youtube использует это состояние, если конкретный IP-адрес уличен в совершении чрезмерного числа запросов, и тогда пользователю необходимо ввести CAPTHA."
    },
    "403":{
            "message":"Forbidden",
            "message_russ":"Запрещено",
            "desc":"Пользователь пытается осуществить доступ к ресурсу, к которому у него нет доступа, и авторизация не изменит положения.",
            "when_used":"Когда сервер понял запрос, но он отказывается его выполнять из-за ограничений в доступе для клиента к указанному ресурсу. Обычно такое случается, когда ресурс не предназначен для публичного доступа."
    },
    "404":{
            "message":"Not Found",
            "message_russ":"Страница не найдена",
            "desc":"Все знакомы с этим кодом, не так ли? Он означает, что запрошенный ресурс не может быть найден, но в будущем – когда он, возможно, там появится, – к нему можно будет осуществить доступ. Также здесь допустимы последующие запросы от клиента. Тем не менее, в большинстве таких случаев применяется код перенаправления из семейства 3хх, и пользователя перенаправляют на альтернативный ресурс или локацию.",
            "when_used":"Довольно часто, особенно если страницу переместили или удалили. Зачастую в подобных случаях сервер автоматически генерирует направляющую страницу с ошибкой 404."
    },
    "405":{
            "message":"Method Not Allowed",
            "message_russ":"Метод не поддерживается",
            "desc":"Метод, при помощи которого совершается запрос к ресурсу, не доступен. Другими словами, ошибка возникает при попытке использовать GET на форме, которая требует ввод данных посредством POST, либо использовании метода PUT на ресурсе, который предназначен только для чтения.",
            "when_used":"Ошибки 405 встречаются в связи с конкретными объектами на веб-странице, для которых был совершен запрос. Например, когда строка запроса в скрипте отличается от пользовательского запроса, в котором подразумевается использование этого скрипта."
    },
    "406":{
            "message":"Not Acceptable",
            "message_russ":"Неприемлемо",
            "desc":"Запрошенный ресурс способен генерировать только тот контент, который не применим к Accept-заголовкам в самом запросе. Браузер способен указывать серверу характеристики данных, которые данные будут принимать от сервера.",
            "when_used":"Если форма файла запрошенного ресурса не совпадает с форматом, который пользователь способен распознать. Мы говорим сейчас о языке программирования, а не о французском!"
    },
    "407":{
            "message":"Proxy Authentication Required",
            "message_russ":"Необходима аутентификация прокси",
            "desc":"Как и код состояния 401, код 407 означает, что клиент сначала должен авторизоваться через прокси. Чтобы сделать это и авторизоваться, прокси должен вернуть поле с заголовком proxy-authenticate, который отвечает требованиям, представленным сервером.",
            "when_used":"Когда сервер думает, что запрос данных от клиента корректным, но доступ к ресурсу возможен только посредством авторизации через прокси-сервер."
    },
    "408":{
            "message":"Request Timeout",
            "message_russ":"Истекло время ожидания",
            "desc":"Время ожидания сервером передачи от клиента истекло.",
            "when_used":"Руководствуясь спецификацией W3 HTTP: «Клиент не сделал запрос в отведенный промежуток времени, который сервер был готов ждать. Клиент МОЖЕТ повторить запрос когда угодно»."
    },
    "409":{
            "message":"Conflict",
            "message_russ":"Конфликт",
            "desc":"Указывает на то, что запрос не может быть выполнен из-за конфликтного обращения к ресурсу.",
            "when_used":"Вы можете получить такой код при загрузке файла на веб-сервер, где уже имеется более свежая версия этого файла, что приводит к конфликту в системе контроля версий."
    },
    "410":{
            "message":"Gone",
            "message_russ":"Удалён",
            "desc":"Такой ответ сервер посылает, если ресурс раньше был по указанному URL, но был удалён и теперь недоступен. Пользователю не следует повторять идентичный запрос.",
            "when_used":"Если более невозможно осуществить доступ к ресурсу посредством данного запроса, и сервер не владеет информацией о возможном месте расположения ресурса. Если у сервера есть подозрение, что документ в ближайшее время может быть восстановлен, то лучше клиенту передать код 404."
    },
    "411":{
            "message":"Length Required",
            "message_russ":"Необходима длина",
            "desc":"Запрос не указывает длину контента, и это было затребовано в совершенном запросе.",
            "when_used":"Когда браузер не определяет длину запрашиваемого контента в заголовке запроса. Сервер не примет запрос без валидного поля заголовка content-length."
    },
    "412":{
            "message":"Precondition Failed",
            "message_russ":"Условие ложно",
            "desc":"Сервер не отвечает одному из предварительных условий, которые отправитель указал в запросе. Другими словами, один или более заголовок запроса был возвращен с атрибутом false.",
            "when_used":"Если заголовок запроса, который совершает валидный запрос к ресурсу, сообщает, что этот конкретный запрос не применим к этому конкретному ресурсу."
    },
    "413":{
            "message":"Request Entity Too Large",
            "message_russ":"Размер запроса слишком велик",
            "desc":"Код 413 отображается в тех случаях, когда сервер отказывается обработать запрос по причине слишком большого размера тела запроса.",
            "when_used":"При использовании в форме метода POST с контентом, по размеру большим, нежели сервер способен обработать."
    },
    "414":{
            "message":"Request-URI Too Large",
            "message_russ":"Запрашиваемый URI слишком длинный",
            "desc":"Этот код отображается, когда сервер не может обработать запрос из-за слишком длинного указанного URL.",
            "when_used":"Когда POST-запрос конвертируется в GET-запрос. POST-запрос поддерживает отправку безграничного объема данных, связывая их с самим запросом. Тем не менее, если запрос должен быть конвертирован в GET-запрос, то запрос позволяет привязать данные формы к URL, что позволяет проводить информацию в больших размерах, чем это было доступно."
    },
    "415":{
            "message":"Unsupported Media Type",
            "message_russ":"Неподдерживаемый тип данных",
            "desc":"Ответ 415 отправляется для указания о том, что сервер заметил, что часть запроса была сделана в неподдерживаемом формате.",
            "when_used":"Когда в запросе не указываются какие-либо типы медиа, которые поддерживаются ресурсом или сервером. Например, пользователь запрашивает изображение с расширением файла, которое не поддерживается сервером. Сервер знает о том, что было запрошено, но не понимает формат, в котором был запрошен ресурс."
    },
    "416":{
            "message":"Requested Range Not Satisfiable",
            "message_russ":"Запрашиваемый диапазон не достижим",
            "desc":"Этот ответ приходит пользователю, когда тот запрашивает часть запрашиваемого ресурса, когда эта часть не может быть предоставлена.",
            "when_used":"Когда у сервера запрашивают XXX-YYY байтов какого-либо ресурса, но ресурс имеет меньший размер, чем указано в запросе."
    },
    "417":{
            "message":"Expectation Failed",
            "message_russ":"Ожидаемое неприемлемо",
            "desc":"Этот ответ может быть получен, когда по каким-то причинам сервер не может удовлетворить значению поля Expect заголовка запроса.",
            "when_used":"Все вполне и так понятно. Когда один из заголовков запроса, заголовок «Expect», имеет запрос, на который сервер не может предоставить ответ."
    },
    "418":{
            "message":"I’m a teapot",
            "message_russ":"Я чайник =)",
            "desc":"Этот код был создан в 1998 году как одна из традиционных первоапрельских шуток IETF, в RFC 2324, Hyper Text Coffee Pot Control Protocol, и вряд ли будет обрабатываться современными HTTP-серверами.",
            "when_used":"Лет 15 назад, ради смеха."
    },
    "422":{
            "message":"Unprocessable Entity",
            "message_russ":"Необрабатываемый экземпляр",
            "desc":"Запрос был принят и понят, но не может быть выполнен ввиду наличия семантических ошибок.",
            "when_used":"Когда сервер успешно принял запрос, может работать с указанным видом данных, в теле запроса XML-документ имеет верный синтаксис, но имеется какая-то логическая ошибка, из-за которой невозможно произвести операцию над ресурсом."
    },
    "423":{
            "message":"Locked",
            "message_russ":"Заблокировано",
            "desc":"Целевой ресурс из запроса заблокирован от применения к нему указанного метода. Чтобы ресурс стал доступным, необходимо снять блокировку или предоставить правильные данные авторизации.",
            "when_used":"Когда ресурс… закрыт. Обычно это случается из соображений безопасности."
    },
    "424":{
            "message":"Failed Dependency",
            "message_russ":"Невыполненная зависимость",
            "desc":"Указывает на то, что реализация текущего запроса может зависеть от успешности выполнения другой операции, и если она не будет успешно проведена, вся обработка запроса будет прервана.",
            "when_used":""
    },
    "425":{
            "message":"Unordered Collection",
            "message_russ":"Неупорядоченный набор",
            "desc":"Этот код отображается, когда ресурс определен в черновиках «WebDAV Advanced Collections Protocol», но не присутствует в «Web Distributed Authoring and Versioning Ordered Collections Protocol».",
            "when_used":""
    },
    "426":{
            "message":"Upgrade Required",
            "message_russ":"Необходимо обновление",
            "desc":"Этот код отображается, когда сервер указывает клиенту на необходимость обновить (переключиться на другой, более новый) протокол.",
            "when_used":"Обычно когда браузер использует устаревшие протоколы."
    },
    "428":{
            "message":"Precondition Required",
            "message_russ":"Необходимо предусловие",
            "desc":"Сервер-источник требует, чтобы в запросе были указаны предварительные условия. Этот код предназначен для того, чтобы избежать конфликта версий ресурса в тех случаях, когда клиент получает (GET) состояние ресурса, изменяет его, и отправляет (PUT) обратно на сервер, и в то же время какая-то третья сторона также изменяет положение ресурса прямо на севере, что приводит к конфликту.",
            "when_used":"Запрашивая указание условий, сервер как бы гарантирует клиентам то, что они используют корректные актуальные копии ресурс. Если же это не соответствует действительно, пользователь получит ошибку 428."
    },
    "429":{
            "message":"Too Many Requests",
            "message_russ":"Слишком много запросов",
            "desc":"Этот ответ посылается, если клиент попытался отправить слишком много запросов за короткое время.",
            "when_used":"Когда пользователь посылает слишком много запросов за короткий промежуток времени."
    },
    "431":{
            "message":"Request Header Fields Too Large",
            "message_russ":"Поля заголовка запроса слишком большие",
            "desc":"Происходит, когда сервер не собирается обрабатывать запрос, так как какое-то из полей заголовка (или все поля заголовков) слишком большое.",
            "when_used":"В основном тогда, когда заголовок запроса от пользователя больше, чем сервер способен обработать. Запрос может быть повторен после того, как будет уменьшен размер полей заголовков в запросе."
    },
    "434":{
            "message":"Requested host unavailable",
            "message_russ":"Запрашиваемый адрес недоступен",
            "desc":"Запрашиваемый адрес недоступен",
            "when_used":""
    },
    "444":{
            "message":"No Response",
            "message_russ":"Закрывает соединение без передачи заголовка ответа. Нестандартный код",
            "desc":"Использовался в лог-файлах Nginx для указания того, что сервер не вернул информацию пользователю и закрыл соединение.",
            "when_used":"Обычно использовался в качестве сдерживающего фактора против вредоносного ПО."
    },
    "449":{
            "message":"Retry With",
            "message_russ":"Повторить с",
            "desc":"Расширение Microsoft, которое указывает на то, что запрос должен быть повторен после применения подходящего действия.",
            "when_used":"Этот код зачастую генерируется, когда выставленные параметры запроса не соответствуют тем, что может принять сервер."
    },
    "450":{
            "message":"Blocked by Windows Parental Controls (Microsoft)",
            "message_russ":"Недоступно по юридическим причинам",
            "desc":"Расширение Microsoft. Эта ошибка выдается, когда параметры Windows Parental Controls выставлены на блокировку доступ к определенным веб-страницам.",
            "when_used":"Когда родители (зная об этой функции) используют родительский контроль, и id-доступа запросил доступ к заблокированному ресурсу."
    },
    "451":{
            "message":"Unavailable For Legal Reasons",
            "message_russ":"Недоступно по юридическим причинам",
            "desc":"Новый HTTP-код состояния для ресурсов, которые заблокированы из юридических соображений. ",
            "when_used":"Используется для указания на то, что доступ к запрашиваемому ресурсу был заблокирован из юридических соображений: например, цензурой, или правительством."
    },
    "500":{
            "message":"Internal Server Error",
            "message_russ":"Внутренняя ошибка сервера",
            "desc":"Данная ошибка говорит о любой внутренней ошибке сервера, которая не входит в рамки остальных ошибок класса.",
            "when_used":"Когда ресурс или ссылка создаются на сервере (вроде календаря в системе бронирования), которые технически не существуют в виде ссылки или доступного ресурса, но показывается пользователю в виде ссылки."
    },
    "501":{
            "message":"Not Implemented",
            "message_russ":"Не реализовано",
            "desc":"Сервер либо не понимает метод в запросе, либо не поддерживает возможностей, необходимых для обработки запроса",
            "when_used":"Вы можете столкнуться с этим, когда сервер не поддерживает нормальные протоколы запроса, вроде GET, OPTIONS, HEAD, POST и т.д."
    },
    "502":{
            "message":"Bad Gateway",
            "message_russ":"Плохой, ошибочный шлюз",
            "desc":"Ответ 502 отображается, когда сервер, выступая в роли шлюза или прокси-сервера, получил недействительное ответное сообщение от вышестоящего сервера.",
            "when_used":"Обычно, когда вышестоящий сервер и прокси-сервер/шлюз не согласовывают между собой протоколы, представленные в запросе, и в результате получается ошибка при обмене данных."
    },
    "503":{
            "message":"Service Unavailable",
            "message_russ":"Сервис недоступен",
            "desc":"Сервер временно не имеет возможности обрабатывать запросы по техническим причинам. В основном, это состоянии является временным.",
            "when_used":"Когда сайт пользуется чрезмерным спросом, и сервер не в состоянии обработать все запросы."
    },
    "504":{
            "message":"Gateway Timeout",
            "message_russ":"Шлюз не отвечает",
            "desc":"Сервер в роли шлюза или прокси-сервера не дождался ответа от вышестоящего сервера для завершения текущего запроса.",
            "when_used":"Когда для передачи данных используется прокси-сервер/шлюз, и два сервера ждут ответов."
    },
    "505":{
            "message":"HTTP Version Not Supported",
            "message_russ":"Версия HTTP не поддерживается",
            "desc":"Сервер не поддерживает указанную в запросе версию протокола HTTP.",
            "when_used":"В случаях, описанных выше! Когда HTTP-протокол более старый, нежели требуется серверу, и следовательно не поддерживается."
    },
    "506":{
            "message":"Variant Also Negotiates",
            "message_russ":"Вариант тоже проводит согласование",
            "desc":"Такой ответ посылается, когда в результате ошибочной конфигурации выбранный вариант указывает сам на себя, из-за чего процесс связывания прерывается.",
            "when_used":"Когда сервер настроен некорректно, и не способен обработать запрос."
    },
    "507":{
            "message":"Insufficient Storage",
            "message_russ":"Переполнение хранилища",
            "desc":"Когда сервер не способен разместить данные, так как не хватает места для выполнения текущего запроса.",
            "when_used":"Когда сервер уже полностью загружен, и пользователь совершает запрос на ресурс, который сервер уже имеет в запасе. Проблема заключается в том, что на сервере нет места для того, чтобы поместить данные, которые посылаются в запросе, чтобы затем выслать запрашиваемый ресурс."
    },
    "509":{
            "message":"Bandwidth Limit Exceeded",
            "message_russ":"Исчерпана пропускная ширина канала",
            "desc":"Этот код ответа используется при превышении веб-площадкой отведённого ей ограничения на потребление трафика.",
            "when_used":"Когда на сервере Apache выполняется корректное расширение, и в ISP установлен уровень пропускного канала, который скоро может быть превышен. Существует несколько опций предела."
    },
    "510":{
            "message":"Not Extended",
            "message_russ":"Не расширено",
            "desc":"Когда на сервере отсутствует расширение, которое желает использовать клиент.",
            "when_used":"Когда сервер требует больше информации в совершаемом запросе."
    },
    "511":{
            "message":"Network Authentication Required",
            "message_russ":"Требуется сетевая аутентификация",
            "desc":"Данный код состояния отображается в случае, если клиент должен сначала авторизоваться в сети, например, ввести пароль для платной точки доступа к Интернету.",
            "when_used":"Когда пользователь предварительно должен дать свое согласие на условия использования, перед тем, как он получит доступ к интернету (например, к Wi-fi точке доступа)."
    }
}